---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.TickMarkPen
source: html/139cc352-2fd6-eb10-a267-9dedd12e8eae.htm
---
# Autodesk.Revit.DB.ParameterTypeId.TickMarkPen Property

"Tick Mark Line Weight"

## Syntax (C#)
```csharp
public static ForgeTypeId TickMarkPen { get; }
```